In [2]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [3]:
# File to Load (Remember to Change These)
file_1 = "Mergerd_table.csv"

In [4]:
# Read Purchasing File and store into Pandas data frame
data = pd.read_csv(file_1)
data.head()

,Unnamed: 0,Country name,2011 AO,2014 AO,2017 AO,2011 PCI,2014 PCI,2017 PCI,2011 SUBS,2014 SUBS,2017 SUBS
0,0,Afghanistan,9.005013,9.961000,14.893312,519,532,488,13797900,18407200,23929700
1,1,Albania,28.268126,37.986355,40.015171,3667,3775,3673,3100000,3359650,3625700
2,2,Algeria,33.286114,50.475788,42.776627,3960,4106,3248,35615900,43298200,45845700
3,3,Arab World,22.260538,30.277130,37.165211,5389,6041,5153,351957917,415029269,416484296
4,4,Argentina,33.130219,50.197296,48.708488,10957,10434,12344,60722700,61234200,61897400

In [8]:
# Change data from string to integer
#data["2011 AO"] = data_df["2011 AO"].astype(int)

In [12]:
data["2011 AO_norm"] = data["2011 AO"]/data["2011 SUBS"]
data.head

SyntaxError: invalid syntax (<ipython-input-12-c8b96a614cec>, line 1)